In [1]:
import requests
from bs4 import BeautifulSoup

url = 'https://www.melon.com/chart/'
headers = {
    'user-agent':'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36',
    'accept': 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7'
}

res = requests.get(url,headers=headers)
soup = BeautifulSoup(res.text,"html.parser")

title_one = soup.select_one("#tb_list .lst50 .ellipsis.rank01 a")
# print(title_one.text)


top_50 = soup.select("#lst50 > td > div")
# print(top_50)
# print(len(top_50))

for i in top_50:
    row = i
    rank = row.select_one('span.rank' )
    # print(rank)


    if rank is not None :
        print(rank.text)

    title = row.select_one('.ellipsis.rank01 > span > a')
    if title is not None :
        print(title.text, end='')

    singer = row.select_one('.ellipsis.rank01 > span > a')
    if title is not None :
        print(singer.text, end='')

1
Good GoodbyeGood Goodbye2
타임캡슐타임캡슐3
DrowningDrowning4
Blue ValentineBlue Valentine5
사랑하게 될 거야사랑하게 될 거야6
ONE MORE TIMEONE MORE TIME7
SPAGHETTI (feat. j-hope of BTS)SPAGHETTI (feat. j-hope of BTS)8
GoldenGolden9
멸종위기사랑멸종위기사랑10
힙합보단 사랑, 사랑보단 돈 (Feat. 베이식)힙합보단 사랑, 사랑보단 돈 (Feat. 베이식)11
하얀 그리움하얀 그리움12
어제보다 슬픈 오늘어제보다 슬픈 오늘13
달리 표현할 수 없어요달리 표현할 수 없어요14
뛰어(JUMP)뛰어(JUMP)15
0+00+016
Zoo (From "Zootopia 2"/Soundtrack Version)Zoo (From "Zootopia 2"/Soundtrack Version)17
첫 눈첫 눈18
NOT CUTE ANYMORENOT CUTE ANYMORE19
FAMOUSFAMOUS20
모르시나요(PROD.로코베리)모르시나요(PROD.로코베리)21
toxic till the endtoxic till the end22
like JENNIElike JENNIE23
너의 모든 순간너의 모든 순간24
HOME SWEET HOME (feat. 태양, 대성)HOME SWEET HOME (feat. 태양, 대성)25
어떻게 이별까지 사랑하겠어, 널 사랑하는 거지어떻게 이별까지 사랑하겠어, 널 사랑하는 거지26
시작의 아이 ❍시작의 아이 ❍27
Soda PopSoda Pop28
내게 사랑이 뭐냐고 물어본다면내게 사랑이 뭐냐고 물어본다면29
천상연천상연30
너에게 닿기를너에게 닿기를31
청춘만화청춘만화32
OVERDRIVEOVERDRIVE33
오늘만 I LOVE YOU오늘만 I LOVE YOU34
IRIS OUTIRIS OUT35
WhiplashWhiplash36
HAPPYHAPPY37
한번 더 이별한번 더 이별38
REBEL HEARTREBEL HEART39
Hollywood ActionHollywood Action40
나는 반딧불나는 반딧불41
365일365일42
XOXZXOXZ43
한 페이지가 될 수 있게한 페이지가 될 수 있게44
사랑은 늘 도망가사랑은 늘 도망가45
DUETDUET46
소나기소나기47
눈사람눈사람48
모든 날, 모든 순간 (Every day, Every Moment)모든 날, 모든 순간 (Every day, Every Moment)49
그대만 있다면 (여름날 우리 X 너드커넥션 (Nerd Connection))그대만 있다면 (여름날 우리 X 너드커넥션 (Nerd Connection))50
운명 (2025)운명 (2025)

In [4]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', np.nan, np.nan, 'M', 'F'],
    'score': [89, 75, 95, np.nan, 93]
})

In [9]:
pd.isna(df).sum()

name      0
gender    2
score     1
dtype: int64

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   gender  3 non-null      object
 2   score   4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

In [14]:
df.describe()
df['score'].describe()

count     4.0000
mean     88.0000
std       9.0185
min      75.0000
25%      85.5000
50%      91.0000
75%      93.5000
max      95.0000
Name: score, dtype: float64

In [19]:
clean_df = df.dropna()
clean_df

      name gender  score
0  Jessica      F   89.0
4     Alex      F   93.0

In [22]:
clean_df = df.dropna(subset={'name','score'})
clean_df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [28]:
df.dropna(subset={'name','score'},inplace=True)
df.reset_index(drop=True)
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [30]:
df = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', np.nan, np.nan, 'M', 'F'],
    'score': [89, 75, 95, np.nan, 93]
})

In [34]:
df.dropna(subset=['name','score'],inplace=True)

In [36]:
df.reset_index(inplace=True)

In [45]:
df.drop(columns=['level_0'],inplace=True)

In [50]:
df1 = df.fillna(0)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   gender  4 non-null      object
 2   score   4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

In [52]:
df1 = df.fillna({'gender':'ect','score':0})
df1

      name gender  score
0  Jessica      F   89.0
1     Liam    ect   75.0
2   Sophia    ect   95.0
3     Alex      F   93.0

In [54]:
df1 = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', 'M', 'F', 'M', 'F'],
    'age': [21, 23, 20, 22, 20]
})

df2 = pd.DataFrame({
    'name': ['Sophia', 'Liam', 'Ryan', 'Alex', 'Jessica'],
    'department': ['computer science', 'mathematics', 'law',
                   'computer science', 'law']
})

df4 = pd.DataFrame({
    'department': ['computer science', 'mathematics', 'law'],
    'head of department': ['Steve', 'Emma', 'Carly']
})

In [56]:
df1

      name gender  age
0  Jessica      F   21
1     Liam      M   23
2   Sophia      F   20
3     Ryan      M   22
4     Alex      F   20

In [57]:
df2

      name        department
0   Sophia  computer science
1     Liam       mathematics
2     Ryan               law
3     Alex  computer science
4  Jessica               law

In [61]:
df3 = pd.merge(df1,df2, on='name')
df3

      name gender  age        department
0  Jessica      F   21               law
1     Liam      M   23       mathematics
2   Sophia      F   20  computer science
3     Ryan      M   22               law
4     Alex      F   20  computer science

In [63]:
df5 = pd.merge(df3,df4,on='department')
df5

      name gender  age        department head of department
0  Jessica      F   21               law              Carly
1     Liam      M   23       mathematics               Emma
2   Sophia      F   20  computer science              Steve
3     Ryan      M   22               law              Carly
4     Alex      F   20  computer science              Steve

In [68]:
df5.sort_values('age',ascending=False)

      name gender  age        department head of department
1     Liam      M   23       mathematics               Emma
3     Ryan      M   22               law              Carly
0  Jessica      F   21               law              Carly
2   Sophia      F   20  computer science              Steve
4     Alex      F   20  computer science              Steve

In [71]:
df5['head of department'].value_counts()

head of department
Carly    2
Steve    2
Emma     1
Name: count, dtype: int64

In [73]:
df10 = pd.DataFrame({
    'test': [45, 30, 40, 37, 48],
    'assign1': [20, 17, 22, 18, 24],
    'assign2': [19, 14, 18, 15, 25]
})

In [74]:
df10.describe()

            test    assign1   assign2
count   5.000000   5.000000   5.00000
mean   40.000000  20.200000  18.20000
std     7.035624   2.863564   4.32435
min    30.000000  17.000000  14.00000
25%    37.000000  18.000000  15.00000
50%    40.000000  20.000000  18.00000
75%    45.000000  22.000000  19.00000
max    48.000000  24.000000  25.00000